---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SplineFailures
source: html/9b229bf3-4983-1fb3-ba14-d9264d76bed4.htm
---
# BuiltInFailures.SplineFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.